app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Hawk Nelson"], ["created_at", "2021-08-01 01:19:07.248698"], ["updated_at", "2021-08-01 01:19:07.248698"]]
---
  def create
    @artist = Artist.new(artist_params)

    if @artist.save